/**
 ******************************************************************************
 * @file    auth.h
 * @author  SCE Team
 * @brief   SCE register definitions and memory map header file.
 *
 ******************************************************************************
 * @attention
 *
 * Copyright 2024-2026 CrossBar, Inc.
 * This file has been modified by CrossBar, Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * You may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 *******************************************************************************
 */

#ifndef __AUTH_H__
#define __AUTH_H__
// #include "types.h"
#include "daric_util.h"
#include "daric.h"
#define NEW_VERSION // New version algorithm ADDR_PKE_SEG_PKB 512 BYTE increased to 1024 BYTE

// #define ALG_TEST_MODE  // Algorithm parallel test mode, remember to turn it off in the official version

// SCE_INTERNEAL_RAM 0x1000--0x3000 mapped to SCE_RAM_ADDR 0x40024000 -- 0x40026000

#define SCE_BASE_ADDR 0x40020000


#define REG_SCE_AES_CRFUNC (*(volatile uint32_t *)(SCE_REG_AES + 0x0))
#define REG_SCE_AES_AR     (*(volatile uint32_t *)(SCE_REG_AES + 0x04))
#define REG_SCE_AES_SRMFSM (*(volatile uint32_t *)(SCE_REG_AES + 0x08))
#define REG_SCE_AES_FR     (*(volatile uint32_t *)(SCE_REG_AES + 0x0C))
#define REG_SCE_AES_OPT1   (*(volatile uint32_t *)(SCE_REG_AES + 0x10))
#define REG_SCE_AES_OPT2   (*(volatile uint32_t *)(SCE_REG_AES + 0x14))
#define REG_SCE_AES_OPT3   (*(volatile uint32_t *)(SCE_REG_AES + 0x18)) // endian data indicator
#define REG_SCE_AES_IV     (*(volatile uint32_t *)(SCE_REG_AES + 0x30))
#define REG_SCE_AES_AKEY   (*(volatile uint32_t *)(SCE_REG_AES + 0x34))
#define REG_SCE_AES_AIB    (*(volatile uint32_t *)(SCE_REG_AES + 0x38))
#define REG_SCE_AES_AOB    (*(volatile uint32_t *)(SCE_REG_AES + 0x3C))

#define AF_KS  0x0
#define AF_ENC 0x01
#define AF_DEC 0x02

// REG_SCE_AES_CRFUNC
#define SCE_AES_FUNC(t) (REG_SCE_AES_CRFUNC = (t & 0x000000FF))

// REG_SCE_AES_AR
#define SCE_AES_AR()           \
    {                          \
        REG_SCE_AES_FR = 0x0F; \
        __DMB();               \
        REG_SCE_AES_AR = 0x5A; \
        __DSB();               \
    } // Clear completion flag, then start

// REG_SCE_AES_FR   write 1 to clear
#define SCE_AES_DONE()                   \
    {                                    \
        while (!(REG_SCE_AES_FR & 0x01)) \
            ;                            \
        REG_SCE_AES_FR |= 0x01;          \
    } // algorithm completion

// REG_SCE_AES_OPT1

#define AES_FIRST_SEG 0x100 // Except for ECB, other modes need to use this flag to identify whether it is the first block of data
#define AES_MODE_ECB  0x00
#define AES_MODE_CBC  0x10
#define AES_MODE_CTR  0x20
#define AES_MODE_CFB  0x40
#define AES_MODE_OFB  0x30

#define AES_128              0x00
#define AES_192              0x01
#define AES_256              0x02
#define SCE_AES_OPT1_MODE(t) (REG_SCE_AES_OPT1 = ((t) & 0x000000FF))

// REG_SCE_AES_OPT2
#define SCE_AES_OPT2_CNT(t) (REG_SCE_AES_OPT2 = (t))

// REG_SCE_AES_OPT3
#define SCE_HASH_OPT3_IV       (0x01 << 0)
#define SCE_HASH_OPT3_KEY      (0x01 << 1)
#define SCE_HASH_OPT3_AIB      (0x01 << 2)
#define SCE_HASH_OPT3_AOB      (0x01 << 3)
#define SCE_HASH_OPT3_CTR      (0x01 << 4)
#define SCE_HASH_OPT3_CTR_ZERO (0x01 << 5)

#define SCE_AES_OPT3_MODE(t) (REG_SCE_AES_OPT3 = (t))

// REG_SCE_AES_IV
#define SCE_AES_SET_IV(t) (REG_SCE_AES_IV = t) // bit11-0   base address offset

// REG_SCE_AES_AKEY
#define SCE_AES_SET_KEY(t) (REG_SCE_AES_AKEY = t) // bit11-0   base address offset

// REG_SCE_AES_AIB
#define SCE_AES_SET_MSG(t) (REG_SCE_AES_AIB = t) // bit11-0   base address offset

// REG_SCE_AES_AOB
#define SCE_AES_SET_OUT(t) (REG_SCE_AES_AOB = t) // bit11-0   base address offset

/*----------------------SCE_RNG------------------------*/
#define SCE_TRNG_BASE_ADDR (SCE_BASE_ADDR + 0xE000)
typedef volatile uint32_t io_rw_32;

#define TRNG_CONTINUOUS_MAX_ATTEMPTS (1024 / 4) // Maximum number of random numbers generated at one time (word)

typedef union
{
    struct
    {
        unsigned int cr_gen_en : 1;
        unsigned int cr_pfilter_en : 1;
        unsigned int cr_hlthtest_en : 1;
        unsigned int cr_drng_en : 1;
        unsigned int cr_postproc_opt : 2;
        unsigned int cr_healthtest_len : 6;
        unsigned int cr_gen_intval : 2;
        unsigned int cr_reseed_intval : 2;
        unsigned int rfu : 16;
    } bits;

    unsigned int postprocValue;
} uPostProc;

typedef struct
{
    /* data */
    io_rw_32  crsrc;    // 0x0
    io_rw_32  crana;    // 0x4
    uPostProc postproc; // 0x8
    // io_rw_32 postproc; // 0x8
    io_rw_32 opt;      // 0xc
    io_rw_32 sr;       // 0x10
    io_rw_32 ar;       // 0x14
    io_rw_32 fr;       // 0x18 ??
    io_rw_32 _pad1;    // 0x1c
    io_rw_32 drpsz;    // 0x20
    io_rw_32 drgen;    // 0x24
    io_rw_32 drreseed; // 0x28
    io_rw_32 _pad2;    // 0x2c
    io_rw_32 buf;      // 0x30
    io_rw_32 _pad3;    // 0x34
    io_rw_32 _pad4;    // 0x38
    io_rw_32 _pad5;    // 0x3c
    io_rw_32 chain0;   // 0x40
    io_rw_32 chain1;   // 0x44
} trng_t;

typedef struct
{
    trng_t           *trng;
    volatile uint32_t remain;
} trng_continuous_t;

#define trng_hw ((trng_t *)SCE_TRNG_BASE_ADDR)

// REG_SCE_TRNG_CRSRC
#define TRNGLF_EN_MASK (1 << 0)
#define TRNGHF_EN_MASK (1 << 1)

/*----------------------SCE_ALU------------------------*/
#define SCE_REG_ALU           SCE_BASE_ADDR + 0xF000
#define REG_SCE_ALU_CRFUNC    (*(volatile uint32_t *)(SCE_REG_ALU + 0x0))
#define REG_SCE_ALU_AR        (*(volatile uint32_t *)(SCE_REG_ALU + 0x04))
#define REG_SCE_ALU_SRMFSM    (*(volatile uint32_t *)(SCE_REG_ALU + 0x08))
#define REG_SCE_ALU_FR        (*(volatile uint32_t *)(SCE_REG_ALU + 0x0C))
#define REG_SCE_ALU_CRDIVLEN  (*(volatile uint32_t *)(SCE_REG_ALU + 0x10))
#define REG_SCE_ALU_SRDIVLEN  (*(volatile uint32_t *)(SCE_REG_ALU + 0x14))
#define REG_SCE_ALU_OPT       (*(volatile uint32_t *)(SCE_REG_ALU + 0x18))
