/**
 ******************************************************************************
 * @file    daric_hal_usb.h
 * @author  USB Team
 * @brief   Header file of USB HAL module.
 ******************************************************************************
 * @attention
 *
 * Copyright 2024-2026 CrossBar, Inc.
 * This file has been modified by CrossBar, Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * You may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 *******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __DARIC_HAL_USB_H
#define __DARIC_HAL_USB_H

#ifdef __cplusplus
extern "C"
{
#endif

/* Includes ------------------------------------------------------------------*/
#include "daric_hal_def.h"
#include <stdint.h>

#define USB_SEND (0)
#define USB_RECV (1)
/*modified for two cdc acm port*/
#define UDC_EP_NUM         8 // 6
#define UDC_ERST_SIZE      1

#define UDC_CTRL_SYSERR_EN (1L << 3) /*only AXI bus error*/
#define UDC_CTRL_EWE       (1L << 10)
#define UDC_CTRL_KP_CNCT   (1L << 11)

/* status register */
#define UDC_STATUS_DEV_CTRL_HALT (1L << 0)
#define UDC_STATUS_SYS_ERR       (1L << 2)
#define UDC_STATUS_EINT          (1L << 3)

/* event config bit */
#define UDC_CFG1_CSC_EVENT_EN            (0x1L << 0)
#define UDC_CFG1_PEC_EVENT_EN            (0x1L << 1)
#define UDC_CFG1_PPC_EVENT_EN            (0x1L << 3)
#define UDC_CFG1_PRC_EVENT_EN            (0x1L << 4)
#define UDC_CFG1_PLC_EVENT_EN            (0x1L << 5)
#define UDC_CFG1_CEC_EVENT_EN            (0x1L << 6)
#define UDC_CFG1_U3_ENTRY_EN             (0x1L << 8)
#define UDC_CFG1_L1_ENTRY_EN             (0x1L << 9)
#define UDC_CFG1_U3_RESUME_EN            (0x1L << 10)
#define UDC_CFG1_L1_RESUME_EN            (0x1L << 11)
#define UDC_CFG1_INACTIVE_PLC_EN         (0x1L << 12)
#define UDC_CFG1_U3_RESUME_NORESP_PLC_EN (0x1L << 13)
#define UDC_CFG1_U2_RESUME_NORESP_PLC_EN (0x1L << 14)

#define UDC_CFG1_SETUP_EVENT_EN (0x1L << 16)

/* erdp bits*/
#define UDC_ERDPLO_EHB        (1 << 3)
#define UDC_ERDPLO_ADDRLO(fv) ((fv) & 0xfffffff0)

/* iman bits*/
#define UDC_IMAN_INT_PEND (1L << 0)
#define UDC_IMAN_INT_EN   (1L << 1)

/* endpoint context data structure bit */
#define UDC_EP_CX_LOGICAL_EP_NUM_MASK   0x00000078
#define UDC_EP_CX_LOGICAL_EP_NUM_SHIFT  3
#define UDC_EP_CX_MULT_MASK             0x00000300
#define UDC_EP_CX_MULT_SHIFT            8
#define UDC_EP_CX_MAX_PSTREAMS_MASK     0x00007C00
#define UDC_EP_CX_MAX_PSTREAMS_SHIFT    10
#define UDC_EP_LINEAR_STRM_ARR_MASK     0x00008000
#define UDC_EP_LINEAR_STRM_ARR_SHIFT    15
#define UDC_EP_CX_INTERVAL_MASK         0x00FF0000
#define UDC_EP_CX_INTERVAL_SHIFT        16
#define UDC_EP_CX_EP_TYPE_MASK          0x00000038
#define UDC_EP_CX_EP_TYPE_SHIFT         3
#define UDC_EP_CX_MAX_BURST_SIZE_MASK   0x0000FF00
#define UDC_EP_CX_MAX_BURST_SIZE_SHIFT  8
#define UDC_EP_CX_MAX_PACKET_SIZE_MASK  0xFFFF0000
#define UDC_EP_CX_MAX_PACKET_SIZE_SHIFT 16
#define UDC_EP_CX_DEQ_CYC_STATE_MASK    0x00000001
#define UDC_EP_CX_DEQ_CYC_STATE_SHIFT   0
#define UDC_EP_CX_TR_DQPT_LO_MASK       0xFFFFFFF0
#define UDC_EP_CX_TR_DQPT_LO_SHIFT      4

/* Endpoint types */
#define USB_CONTROL_ENDPOINT     (0)
#define USB_ISOCHRONOUS_ENDPOINT (1)
#define USB_BULK_ENDPOINT        (2)
#define USB_INTERRUPT_ENDPOINT   (3)

/* USB power state */
#define USB_POWER_STATE_U3     3
#define USB_POWER_STATE_U2     2
#define USB_POWER_STATE_U0     0
#define USB_POWER_SATTE_RESUME 15

    /* device speed */
    typedef enum
    {
        USB_SPEED_UNKNOWN = 0,
        USB_SPEED_LOW,
        USB_SPEED_FULL,
        USB_SPEED_HIGH,
        USB_SPEED_WIRELESS,
        USB_SPEED_SUPER,
        USB_SPEED_SUPER_PLUS,
    } HAL_USB_SpeedTypeDef;

    typedef enum
    {
        USB_TRANSFER_BULK,
        USB_TRANSFER_INTERRUPT,
        USB_TRANSFER_ISOCHRONOUS
    } USB_TransferTypeDef;

    /* corigine usb 3.1 device core register macros */
    typedef volatile struct
    {
        uint32_t capability; /* 0x00: device capability */
        uint32_t resv0[3];
        uint32_t devconfig; /* 0x10: config0 */
        uint32_t evtconfig; /* 0x14: config1 */
        uint32_t resv1[2];
        uint32_t command;    /* 0x20: USB command */
        uint32_t status;     /* 0x24: USB status */
        uint32_t dcbaplo;    /* 0x28: device context base address (DCBA) Pointer Low */
        uint32_t dcbaphi;    /* 0x2C: device context base address (DCBA) Pointer High */
        uint32_t portsc;     /* 0x30: PORT Status and Control */
        uint32_t u3portpmsc; /* 0x34: USB3 Port PM Status and Control, not used */
        uint32_t u2portpmsc; /* 0x38: USB2 Port PM Status and Control */
        uint32_t u3portli;   /* 0x3C: USB3 Port Link Info, not used */
        uint32_t doorbell;   /* 0x40: Door Bell Register */
        uint32_t mfindex;    /* 0x44: Microframe Index */
        uint32_t ptmctr;     /* 0x48: PTM control */
        uint32_t ptmsts;     /* 0x4C: PTM status */
        uint32_t resv3[4];
        uint32_t ep_enable;  /* 0x60: ep enable */
        uint32_t ep_running; /* 0x64: ep running */
        uint32_t resv4[2];
        uint32_t cmd_param0;  /* 0x70: Command Parameter 0 */
        uint32_t cmd_param1;  /* 0x74: Command Parameter 1 */
        uint32_t cmd_control; /* 0x78: Command Control */
        uint32_t resv5[1];
        uint32_t odb_cap; /* 0x80: odb capability */
        uint32_t resv6[3];
        uint32_t odb_config[8]; /* Command Control 90-a0*/
        uint32_t debug0;        /* 0xB0: debug register */
    } HAL_USB_CtlRegTypeDef;

    typedef volatile struct
    {
        uint32_t iman;   /* 0x100：Interrupter Management */
        uint32_t imod;   /* 0x104: Interrupter Moderation */
        uint32_t erstsz; /* 0x108：Event Ring Segment Table Size */
        uint32_t resv0;
        uint32_t erstbalo; /* 0x110: Event Ring Segment Table Base Address */
        uint32_t erstbahi; /* 0x114: Event Ring Segment Table Base Address */
        uint32_t erdplo;   /* 0x118: Event Ring Dequeue Pointer */
        uint32_t erdphi;   /* 0x11C: Event Ring Dequeue Pointer */
    } HAL_USB_IntRegTypeDef;

    /* buffer info data structure */
    typedef struct
    {
        void    *vaddr;
        uint64_t dma;
        uint32_t len;
    } HAL_USB_BufInfoDef;

    /* trb data structure */
    typedef struct
    {
        uint32_t dw0;
        uint32_t dw1;
        uint32_t dw2;
        uint32_t dw3;
    } HAL_USB_EvtTrbDef, HAL_USB_TransTrbDef;

    /* udc endpoint context data structure */
    typedef struct
    {
        uint32_t dw0;
        uint32_t dw1;
        uint32_t dw2;
        uint32_t dw3;
    } HAL_USB_EpCtxDef;

    /* udc endpoint data structure */
    typedef struct
    {
        uint8_t  ep_num;    /* Endpoint number */
        uint8_t  direction; /* Endpoint direction */
        uint8_t  type;
        uint16_t max_packet_size;

        HAL_USB_BufInfoDef   tran_ring_info;
        HAL_USB_TransTrbDef *first_trb;
        HAL_USB_TransTrbDef *last_trb;
